/******************************************************************************
1.5 Напечатайте узор шахматной доски при помощи символов
пробела и *, используя восемь операторов printf. Затем нарисуйте ту
же самую картинку, используя всего лишь один оператор printf.
*******************************************************************************/
/* Решение Щуровская Полина, 23.03.2023 */
#include <stdio.h>

int main()
{
    printf("----------\n");
   printf("|* * * * |\n");
    printf("| * * * *|\n");
     printf("|* * * * |\n");
     printf("| * * * *|\n");
      printf("|* * * * |\n");
      printf("| * * * *|\n");
       printf("|* * * * |\n");
      printf("| * * * *|\n");
      printf("----------\n");
     
}
